void setup() {
}

void loop() {
    int buttonState = digitalRead(2); // читаємо стан піна 2

    if (buttonState == HIGH) { // Якщо значення змінної buttonState рівне 1 (5V або HIGH)
      digitalWrite(13, HIGH); // то подаємо сигнал 5V на 13 пін
    } else { // інакше
      digitalWrite(13, LOW);  // вимикаємо (ставимо напругу біля 0)
    }
}

/*
    == : дорівнює (не плутайте з =, який призначає значення правої частини лівій).
    != : не дорівнює.
    > / < : більше або менше.
    >= / <= : більше або дорівнює, або менше або дорівнює.


    && (І): умова істинна, лише якщо обидві частини правдиві.
    Наприклад:
    if (temp > 20 && light == LOW) { ... }
    || (АБО): умова істинна, якщо хоча б одна частина правдива.
    if (button1 == HIGH || button2 == HIGH) { ... }
    ! (НЕ): інвертує значення.
    if (!isPaused) { ... } (виконувати, якщо НЕ на паузі).

*/
