// Визначаємо розміри нашої піксельної матриці
const int ROWS = 5;
const int COLS = 5;

// Двовимірний масив:
// Карта нашого смайлика
//(1 - зафарбовано, 0 - пусто)
byte smile[ROWS][COLS] = {
    {0, 1, 0, 1, 0},
    {0, 0, 0, 0, 0},
    {1, 0, 0, 0, 1},
    {0, 1, 1, 1, 0},
    {0, 0, 0, 0, 0}
};

void setup() {
    // Запуск порту на високій швидкості 115200
    Serial.begin(115200);
    // Коротка пауза для стабілізації порту
    delay(1000);

    Serial.println("--- СКАНУВАННЯ 2D МАСИВУ ---");
    Serial.println();

    //Прохід по матриці двома вкладеними циклами for
    // Зовнішній цикл перебирає РЯДКИ (зверху вниз)
    for (int r = 0; r < ROWS; r++) {
        // Внутрішній цикл перебирає СТОВПЧИКИ (зліва направо)
        for (int c = 0; c < COLS; c++) {

            // Перевіряємо значення поточної комірки [Рядок][Стовпчик]
            if (smile[r][c] == 1) {
                // Якщо одиниця — малюємо жирний піксель і пробіл
                Serial.print("■ ");
            } else {
                // Якщо нуль — малюємо два порожніх пробіли
                Serial.print("  ");
            }

        }
        // Коли стовпчики поточного рядка закінчилися
        // — переносимо курсор на новий рядок!
        Serial.println();
    }

    Serial.println();
    Serial.println("--- ГРАФІКА СФОРМОВАНА ---");
}

void loop() {
    // Код виконується один раз в setup, loop залишаємо порожнім
}