// Підключення бібліотеки для роботи
// з LCD-дисплеєм по шині I2C
#include <LiquidCrystal_I2C.h>

// Створення об'єкта LCD:
// 0x27 - I2C-адреса дисплея
// 16 - кількість стовпців
// 2  - кількість рядків
LiquidCrystal_I2C lcd(0x27, 16, 2);

// Власний символ української літери "П"
byte letterP[8] = {
  B11111,
  B10001,
  B10001,
  B10001,
  B10001,
  B10001,
  B10001,
  B00000,
};

// Власний символ української літери "И"
byte letterU[8] = {
  B10011,
  B10011,
  B10101,
  B10101,
  B10101,
  B11001,
  B11001,
  B00000,
};

// Символ анімації 20%
byte p20[8] = {
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
};

// Символ анімації 40%
byte p40[8] = {
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
};

// Символ анімації 60%
byte p60[8] = {
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
};

// Символ анімації 80%
byte p80[8] = {
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
};

// Символ анімації 100%
byte p100[8] = {
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
};

void setup() {
  // Ініціалізація послідовного порту
  Serial.begin(9600);

  // Ініціалізація LCD-дисплея
  lcd.init();

  // Увімкнення підсвічування дисплея
  lcd.backlight();

  // Запис власних символів у пам'ять CGRAM дисплея
  // Максимально можна зберегти 8 символів (0...7)
  lcd.createChar(0, letterP);
  lcd.createChar(1, letterU);
  lcd.createChar(2, p20);
  lcd.createChar(3, p40);
  lcd.createChar(4, p60);
  lcd.createChar(5, p80);
  lcd.createChar(6, p100);
}

void loop() {
  // відтворення анімації
  // перший цикл переміщає позиції курсора по символьно
  for (int i=0; i<16; i++) {
    // відтворення анімації в межах символа
    for (int j=2; j<7; j++) {
      // Встановлення курсора:
      // перший рядок позиція з першого циклу
      lcd.setCursor(i,0);
      // запис анімованого символу
      lcd.write(j);

      // другий рядок позиція з першого циклу
      lcd.setCursor(i,1);
      // запис анімованого символу
      lcd.write(j);
      delay(10);
    }
  }

  delay(500);
  // очищення дисплею
  lcd.clear();
  // Встановлення курсора:
  // перший стовпець, перший рядок
  lcd.setCursor(0, 0);

  // Виведення привітання
  lcd.print(" Hello, world!");

  // Переміщення курсора:
  // другий стовпець, другий рядок
  lcd.setCursor(1, 1);

  // Виведення власного символу №0 ("П")
  lcd.write(0);

  // Виведення стандартного символу "P"
  lcd.print("P");

  // Виведення власного символу №1 ("И")
  lcd.write(1);

  // Продовження тексту
  lcd.print("BIT, CBITE!");

  // Затримка 2 секунди
  delay(2000);
}