 // Підключення бібліотеки для роботи
// з LCD-дисплеєм по шині I2C
#include <LiquidCrystal_I2C.h>

// Створення об'єкта LCD:
// 0x27 - I2C-адреса дисплея
// 16 - кількість стовпців
// 2  - кількість рядків
LiquidCrystal_I2C lcd(0x27, 16, 2);

// Власний символ української літери "П"
byte letterP[8] = {
    B11111,
    B10001,
    B10001,
    B10001,
    B10001,
    B10001,
    B10001,
    B00000,
  };

// Власний символ української літери "И"
byte letterU[8] = {
    B10011,
    B10011,
    B10101,
    B10101,
    B10101,
    B11001,
    B11001,
    B00000,
  };

void setup() {
    // Ініціалізація послідовного порту
    Serial.begin(9600);

    // Ініціалізація LCD-дисплея
    lcd.init();

    // Увімкнення підсвічування дисплея
    lcd.backlight();

    // Запис власних символів у пам'ять CGRAM дисплея
    // Максимально можна зберегти 8 символів (0...7)
    lcd.createChar(0, letterP);
    lcd.createChar(1, letterU);

    // Встановлення курсора:
    // перший стовпець, перший рядок
    lcd.setCursor(0, 0);

    // Виведення привітання
    lcd.print(" Hello, world!");
}

void loop() {

    // Переміщення курсора:
    // другий стовпець, другий рядок
    lcd.setCursor(1, 1);

    // Виведення власного символу №0 ("П")
    lcd.write(0);

    // Виведення стандартного символу "P"
    lcd.print("P");

    // Виведення власного символу №1 ("И")
    lcd.write(1);

    // Продовження тексту
    lcd.print("BIT, CBITE!");

    // Затримка 2 секунди
    delay(2000);
}